#include <iostream>
#include <Windows.h>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

/*ЗАДАНИЕ 1
Заданы три сопротивлении R1, R2, R3. 
Вычислить значение сопротивления R0 по формуле: 1/R0 = 1/R1+1/R2+1/R3.*/

	cout << "Завдання 3.1\n\n";
	double R1, R2, R3, R0;    // 1/R0 = 1/R1+1/R2+1/R3.
	cout << "Введи перший опір(R1):" << endl;
	cin >> R1;
	cout << "Введи другий опір(R2):" << endl;
	cin >> R2;
	cout << "Введи третій опір(R3):" << endl;
	cin >> R3;
	R0 = 1 / R1 + 1 / R2 + 1 / R3;
	R0 = 1 / R0;
	cout << "Загальний опір (R0) = " << R0 << endl;


/*ЗАДАНИЕ 2
По заданной длине окружности найти площадь круга
по формуле S = pi*R2, радиус вычислить из формулы длины
окружности: L=2*pi *R.*/

	cout << "Завдання 3.2\n\n";
	const float pi = 3.14;
	double R, L, S;   // L=2*pi*R    S = pi*R^2
	cout << "Введіть довжину кола (L):" << endl;
	cin >> L;
	R = L / (2 * pi);
	S = pi * pow(R,2);
	cout << "Радіус = " << R << "\nПлоща кола = " << S << endl;

/*ЗАДАНИЕ 3
Вычислить пройденное расстояние при прямолинейном
равноускоренном движении по формуле S = v*t + (a*t2) / 2,
где v — скорость, t — время, а — ускорение.*/

	cout << "Завдання 3.3\n\n";
	double S, v, t, a;  // S = v*t + (a*t^2) / 2
	cout << "Введіть швидкість (v):" << endl;
	cin >> v;
	cout << "Введіть час (t):" << endl;
	cin >> t;
	cout << "Введіть прискорення (a):" << endl;
	cin >> a;
	S = (v * t) + ((a * pow(t, 2)) / 2);
	cout << "відстань (S) = "<< S << endl;
}
