#include <iostream>
#include <Windows.h>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

/*ЗАДАНИЕ 1
Пользователь вводит с клавиатуры целое шестизначное
число. Написать программу, которая определяет, является ли
введенное число — счастливым (Счастливым считается шестизначное
 число, у которого сумма первых 3 цифр равна сумме
вторых трех цифр). Если пользователь ввел не шестизначное
число — сообщение об ошибке.*/

	/*cout << "Завдання №1" << endl;
	int num = 0,n1,n2,n3,n4,n5,n6;
	cout << "Введіть ціле шестизначне число :" << endl;
	cin >> num;
	if (num < 100000 && num > 999999)
	{
		cout << "Error! Введіть шестизначне число!" << endl;
	}
	//123456
	n6 = num % 10;  //6
	num = num / 10;
	n5 = num % 10;  //5
	num = num / 10;
	n4 = num % 10;  //4
	num = num / 10;
	n3 = num % 10;  //3
	num = num / 10;
	n2 = num % 10;  //2
	num = num / 10;
	n1 = num % 10;  //1
	if (n1 + n2 + n3 == n4 + n5 + n6) { cout << "Число щасливе!" << endl; }
	else { cout << "Число не щасливе." << endl; }*/


/*ЗАДАНИЕ 2
Пользователь вводит четырехзначное число. Необходимо
поменять в этом числе 1 и 2 цифры, а также 3 и 4 цифры. Если
пользователь вводит не четырехзначное число — вывести
сообщение об ошибке.*/

	/*cout << "Завдання №2" << endl;
	int number, num1, num2, num3, num4;
	cout << "Введіть ціле 4-значне число :" << endl;
	cin >> number;
	if (number < 1000 && number > 9999)
	{
		cout << "Error! Введіть 4-значне число!" << endl;
	}
	num4 = number % 10;
	number = number / 10;
	num3 = number % 10;
	number = number / 10;
	num2 = number % 10;
	number = number / 10;
	num1 = number % 10;
	int numb = (num2 * 1000) + (num1 * 100) + (num4 * 10) + num3;
	cout << numb << endl;*/

/*ЗАДАНИЕ 3
Пользователь вводит с клавиатуры 7 целых чисел. Напишите
программу, которая определяет максимальное из этих 7 чисел.*/

	/*cout << "Завдання №3" << endl;
	int n_1, n_2, n_3, n_4, n_5, n_6, n_7;
	cout << "Введи 7 цілих чисел :" << endl;
	cin >> n_1 >> n_2 >> n_3 >> n_4 >> n_5 >> n_6 >> n_7;
	if (n_1 >= n_2 && n_1 >= n_3 && n_1 >= n_4 && n_1 >= n_5 && n_1 >= n_6 && n_1 >= n_7)
	{
		cout << "Найбільше число - " << n_1 << endl;
	}
	 else if (n_2 > n_1 && n_2 >= n_3 && n_2 >= n_4 && n_2 >= n_5 && n_2 >= n_6 && n_2 >= n_7)
	{
		cout << "Найбільше число - " << n_2 << endl;
	}
	 else if (n_3 > n_1 && n_3 > n_2 && n_3 >= n_4 && n_3 >= n_5 && n_3 >= n_6 && n_3 >= n_7)
	{
		cout << "Найбільше число - " << n_3 << endl;
	}
	else if (n_4 > n_1 && n_4 > n_2 && n_4 > n_3 && n_4 >= n_5 && n_4 >= n_6 && n_4 >= n_7)
	{
		cout << "Найбільше число - " << n_4 << endl;
	}
	else if (n_5 > n_1 && n_5 > n_2 && n_5 > n_3 && n_5 > n_4 && n_5 >= n_6 && n_5 >= n_7)
	{
		cout << "Найбільше число - " << n_5 << endl;
	}
	else if (n_6 > n_1 && n_6 > n_2 && n_6 > n_3 && n_6 > n_4 && n_6 > n_5 && n_6 >= n_7)
	{
		cout << "Найбільше число - " << n_6 << endl;
	}
	else if (n_7 > n_1 && n_7 > n_2 && n_7 > n_3 && n_7 > n_4 && n_7 > n_5 && n_7 > n_6)
	{
		cout << "Найбільше число - " << n_7 << endl;
	}*/

/*ЗАДАНИЕ 4
Грузовой самолет должен пролететь с грузом из пункта А
в пункт С через пункт В. Емкость бака для топлива у самолета — 300 литров. 
Потребление топлива на 1 км в зависимости
от веса груза у самолета следующее:
+ до 500 кг — 1 литров/км;
+ до 1000 кг — 4 литров/км;
+ до 1500 кг — 7 литров/км;
+ до 2000 кг — 9 литров/км;
+ более 2000 кг — самолет не поднимает.
Пользователь вводит расстояние между пунктами А и В,
и расстояние между пунктами В и С, а также вес груза. 
Программа должна рассчитать какое минимальное количество
топлива необходимо для дозаправки самолету в пункте В,
чтобы долететь из пункта А в пункт С. В случае 
невозможности преодолеть любое из расстояний — программа должна
вывести сообщение о невозможности полета по введенному
маршруту.*/

	/*cout << "Завдання №4" << endl;
	int fuel = 300, add_fuel = 0, minus_fuel = 0,minus_fuel2, dist_A_B = 0, dist_B_C = 0;
	int kg = 0, limit_kg1 = 500, limit_kg2 = 1000, limit_kg3 = 1500, limit_kg4 = 2000;
	int l_km = 0, l_km1 = 1, l_km2 = 4, l_km3 = 7, l_km4 = 9;
	cout << "Введіть відстань від пункту А до пункту В - ";
	cin >> dist_A_B;
	cout << "Введіть відстань від пункту B до пункту C - ";
	cin >> dist_B_C;
	cout << "Введіть вагу вантажу - ";
	cin >> kg;
	if (kg <= limit_kg1) { l_km = l_km1; }
	else if (kg > limit_kg1 && kg <= limit_kg2) { l_km = l_km2; }
	else if (kg > limit_kg2 && kg<=limit_kg3) { l_km = l_km3; }
	else if (kg > limit_kg3 && kg<=limit_kg4) { l_km = l_km4; }
	else { cout << "Літак не взлетить!" << endl; }
	minus_fuel = l_km * dist_A_B;
	if (minus_fuel > fuel) { cout << "Літак не долитить пункту В!" << endl; }
	else
	{
		fuel -= minus_fuel;
		minus_fuel2 = l_km * dist_B_C;
		if (minus_fuel2 > 300) 
		{ 
			cout << "Літак не долитить пункту C! Бак не вмістить ту кількість палива, яку потрібно" << endl;
		}
		else if (minus_fuel2 > fuel)
		{
			add_fuel = minus_fuel2 - fuel;
			cout << "Дозаправити в пункті В потрібно мінімум - " << add_fuel << " літрів" << endl;
		}
		else { cout << "Дозаправка не потрібна."; }
	}*/
}