#include <iostream>
#include <Windows.h>
#include <random>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

/*ЗАДАНИЕ 1
Написать программу, копирующую последовательно элементы
одного массива размером 10 элементов в 2 массива размером
5 элементов каждый. Элементы первоначального массива можно
сгенерировать в произвольном диапазоне.*/
	cout << "Завдання №1" << endl;
	int const n1 = 10, n2 = 5;
	int mas[n1], mas1[n2], mas2[n2];
	srand(time(0));
	cout << "Основний масив" << endl;
	for (int i = 0; i < n1; i++)
	{
		mas[i] = -5 + rand() % 11;
		cout << mas[i] << " ";
	}
	cout << "\nПерший масив" << endl;
	for (int i = 0; i < n2; i++)
	{
		mas1[i] = mas[i];
		cout << mas1[i] << " ";
	}
	cout << "\nДругий масив" << endl;
	for (int i = 0; i < n2; i++)
	{
		mas2[i] = mas[i+n2];
		cout << mas2[i] << " ";
	}



/*ЗАДАНИЕ 2
Напишите программу, которая выполняет поэлементную
сумму двух массивов и результат заносит в третий массив.
Элементы массивов можно сгенерировать в произвольном
диапазоне*/
	/*cout << "Завдання №2" << endl;
	int const n = 10;
	int mas[n], mas1[n], mas2[n];
	srand(time(0));
	cout << "Перший масив" << endl;
	for (int i = 0; i < n; i++)
	{
		mas1[i] = -5 + rand() % 11;
		mas2[i] = -5 + rand() % 11;
		cout << mas1[i] << " ";
	}
	cout << "\nДругий масив" << endl;
	for (int i = 0; i < n; i++)
	{
		cout << mas2[i] << " ";
		mas[i] = mas1[i] + mas2[i];
	}
	cout << "\nМасив результатів додавання" << endl;
	for (int i = 0; i < n; i++)
	{
		cout << mas[i] << " ";
	}*/



/*ЗАДАНИЕ 3
Пользователь вводит данные о своих расходах в долларах за неделю (каждый день). Написать программу, которая
вычисляет:
+ среднюю (за неделю) потраченную сумму;
+ общую сумму, потраченную пользователем за неделю;
+ количество дней и их названия (например, «вторник»),
когда сумма расхода (в день) превысила 100 долларов.*/
	/*cout << "Завдання №3" << endl;
	int const n = 7;
	int mas[n], count = 0;
	float sum = 0, midle;
	string mas_days[7] = { "Понеділок", "Вівторок", "Середа","Четверг","П'ятниця","Субота","Неділя" };
	srand(time(0));
	for (int i = 0; i < n; i++)
	{
		i++;
		cout << "Введіть витратив в " << i-- << " день = ";
		cin >> mas[i];
		sum += mas[i];
		if (mas[i] >= 100) { count += 1; }
	}
	cout << endl;
	midle = sum / n;
	cout << "Всього витрачено за 7 днів = " << sum << endl;
	cout << "Середня витрачена сума за тиждень = " << midle << endl;
	cout << "Кількість днів, коли було витрачено більше 100 $ = " << count << endl;
	for (int i = 0; i < n; i++)
	{
		if (mas[i] >= 100)
		{
			cout << mas_days[i] << " = " << mas[i]<<" $\n";
		}
	}*/



/*ЗАДАНИЕ 4
Известны данные курса валют (курс доллара по отношению
к евро) за все месяцы года и начисленные проценты за каждый месяц на депозитном счету в евро. Все данные вводятся
пользователем, в том числе и сумма на депозите в евро.
Написать программу, которая по запросу пользователя
(номер месяца) выводит в консоль размер допустимой суммы,
которую он может обналичить, при условии, что у него долларовая карта, обналичить можно не более 50% от начисленной
суммы в том случае, если начисленная сумма в этот месяц
составляет не менее 500$.*/
	/*cout << "Завдання №4" << endl;
	const int n = 12;
	int month[n], percent[n], number;
	float USD_EUR[n], EUR[n], USD[n];
	srand(time(0));
	cout << "Нараховані відсотки за кожен місяць" << endl;
	for (int i = 0; i < n; i++)
	{
		percent[i] = rand() % 26;
		USD_EUR[i] = (65 + rand() % 36)/100.0;
		EUR[i] = 100 + rand() % 901;
		EUR[i] += (percent[i] * EUR[i]) / 100;
		cout << percent[i] << "; ";
	}
	cout << "\nCуму на депозиті (в євро)" << endl;
	for (int i = 0; i < n; i++) { cout << EUR[i] << "; "; }
	cout << "\nКурс валют за кожен місяць (EUR->USD)" << endl;
	for (int i = 0; i < n; i++) { cout << USD_EUR[i] << "; "; }
	cout << "\nCуму на депозиті (в доларах)" << endl;
	for (int i = 0; i < n; i++)
	{
		USD[i] = EUR[i] * USD_EUR[i];
		cout << USD[i] << "; ";
	}
	while (true)
	{
		cout << "\nВведіть номер місяця = "; cin >> number;
		if (number > 0 && number <= 12)
		{
			if (USD[number-1] >= 500)
			{
				cout << "Дозволено зняти в цьому місяці = " << USD[number-1] / 2 << " $" << endl;
				break;
			}
			else
			{
				cout << "В цьому місяці не можна знімати гроші. Виберіть інший місяць." << endl;
			}
		}
		else{ cout << "Виберіть номер місяця!!! (1-12)" << endl; }
	}*/
}
