#include <iostream>
#include <Windows.h>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);


/*ЗАДАНИЕ 1
Подсчитать количество целых чисел в диапазоне от 100
до 999, у которых есть две одинаковые цифры*/
	/*cout << "Завдання №1" << endl;
	int n1 = 0, n2 = 0, n3 = 0, count = 0, temp;
	for (int i = 100; i <= 999; i++)
	{
		n1 = i % 10;
		temp = i / 10;
		n2 = temp % 10;
		temp = i / 100;
		n3 = temp % 10;
		if (n1 == n2 && n1 != n3 && n2 != n3) { count += 1; cout << n3 << n2 << n1 << endl;}
		else if (n1 == n3 && n1 != n2 && n2 != n3) { count += 1; cout << n3 << n2 << n1 << endl;}
		else if (n2 == n3 && n1 != n2 && n1 != n3) { count += 1; cout << n3 << n2 << n1 << endl;}
	}
	cout << "Кількість чисел з 2 однаковими цифрами = " << count << endl;*/



/*ЗАДАНИЕ 2
Подсчитать количество целых чисел в диапазоне от 100 до
999, у которых все цифры разные.*/
	/*cout << "Завдання №2" << endl;
	int num1 = 0, num2 = 0, num3 = 0, count2 = 0, t;
	for (int i = 100; i <= 999; i++)
	{
		num1 = i % 10;
		t = i / 10;
		num2 = t % 10;
		t = i / 100;
		num3 = t % 10;
		if (num1 != num2 && num1 != num3 && num2 != num3) { count2 += 1; cout << num3 << num2 << num1 << endl; }
	}
	cout << "Кількість чисел з різними цифрами = " << count2 << endl;*/


/*ЗАДАНИЕ 3
Пользователь вводит любое целое число. Необходимо из
этого целого числа удалить все цифры 3 и 6 и вывести обратно
на экран.*/
	/*cout << "Завдання №3" << endl;
	int num, n, rez = 0, temp = 0;
	cout << "Введіть ціле число : "; cin >> num;
	do
	{
		n = num % 10;
		if (n != 3 && n != 6)
		{
			rez += n * pow(10, temp);
			temp++;
		}
		num /= 10;
	} while (num > 0);
	cout << rez << endl;*/



/*ЗАДАНИЕ 4
Пользователь вводит любое целое число А. Необходимо
вывести все целые числа В, для которых А делиться без остатка
на В*В и не делиться без остатка на В*В*В.*/
	/*cout << "Завдання №4" << endl;
	int A, B, temp;
	cout << "Введи число А = "; cin >> A;
	temp = A;
	while (temp > 1)
	{
		B = temp;
		if ((A % (B * B) == 0) && (A % (B * B * B) != 0))
		{
			cout << B << endl;
		}
		temp -= 1;
	}*/


/*ЗАДАНИЕ 5
Пользователь вводит целое число А. Программа должна
определить, что куб суммы цифр этого числа равен А*А.*/
	/*cout << "Завдання №5" << endl;
	int A, n, n_sum = 0, a;
	cout << "Введи число А = "; cin >> A;
	a = A;
	while (a > 0)
	{
		n = a % 10;
		n_sum += n;
		a /= 10;
	}
	if (pow(n_sum, 3) == (A * A)) 
	{ cout << "Куб суми цифр числа = квадрату числа!" << endl; }
	else{cout << "Куб суми цифр числа не дорівнює квадрату числа!" << endl;}*/


/*ЗАДАНИЕ 6
Пользователь вводит целое число. Необходимо вывести все
целые числа, на которое заданное число делиться без остатка.*/
	/*cout << "Завдання №6" << endl;
	int number;
	cout << "Введи число = "; cin >> number;
	cout << "Числа, на які націло ділиться введене число :" << endl;
	for (int i = 1; i <= number; i++)
	{
		if (number % i == 0)
		{
			cout << i << endl;
		}
	}*/


/*ЗАДАНИЕ 7
Пользователь вводит два целых числа. 
Необходимо вывести все целые числа, на которые оба введенных числа делятся
без остатка.*/
	/*cout << "Завдання №7" << endl;
	int num1, num2, min;
	cout << "Введи 1 число = "; cin >> num1;
	cout << "Введи 2 число = "; cin >> num2;
	if (num1 < num2) { min = num1; }
	else if (num2 < num1) { min = num2; }
	else { cout << "Введені числа рівні!!" << endl; min = num1; }
	cout << "Числа, на які націло діляться 2 введені числа :" << endl;
	for (int i = 1; i <= min; i++)
	{
		if (num1 % i == 0 && num2 % i == 0)
		{
			cout << i << endl;
		}
	}*/
}