#include <iostream>
#include <Windows.h>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	
/*ЗАДАНИЕ 1
Напишите программу, которая вычисляет сумму целых
чисел от а до 500 (значение a вводится с клавиатуры).*/

	/*cout << "Задача №1" << endl;
	int a, sum = 0;
	while (true)
	{
		cout << "Введи a (початок діапазону) : "; cin >> a;
		if (a > 0 && a <= 500) 
		{
			for (int i = a; i <= 500; i++)
			{
				sum += i;
			}
			cout << "Сума чисел від " << a << " до 500 = " << sum << endl;
			break;
		}
		else { cout << "Введи а в діапазоні від 1 до 500!!!" << endl; }
	}*/


/*ЗАДАНИЕ 2
Напишите программу, которая запрашивает два целых числа
x и y, после чего вычисляет и выводит значение x в степени y.*/

	/*cout << "Задача №2" << endl;
	int x, y, power = 1;
	cout << "Введи х = "; cin >> x;
	cout << "Введи y = "; cin >> y;  //x^y
	for (int i = 1; i <= y; i++)   // або pow(x,y); замість конструкції for
	{
		power *= x;
	}
	cout << "x^y = " << power << endl;*/


/*ЗАДАНИЕ 3
Найти среднее арифметическое всех целых чисел от 1 до 1000.*/

	/*cout << "Задача №3" << endl;
	float n = 1000, sum = 0, sr_ar;
	for (int i = 1; i <= n; i++)
	{
		sum += i;
	}
	sr_ar = sum / n;
	cout << "Середнє арифметичне від 1 до 1000 = " << sr_ar << endl;*/


/*ЗАДАНИЕ 4
Найти произведение всех целых чисел от a до 20 (значение
a вводится с клавиатуры: 1 <=a <= 20).*/

	/*cout << "Задача №4" << endl;
	int A, dob = 1;
	while (true)
	{
		cout << "Введи a (початок діапазону) : "; cin >> A;
		if (A > 0 && A <= 20)
		{
			for (int i = A; i <= 20; i++)
			{
				dob *= i;
			}
			cout << "Добуток чисел від " << A << " до 20 = " << dob << endl;
			break;
		}
		else { cout << "Введи а в діапазоні від 1 до 20!!!" << endl; }
	}*/


/*ЗАДАНИЕ 5
Написать программу, которая выводит на экран таблицу
умножения на k, где k — номер варианта. Например, для 7-го
варианта:
7 x 2 = 14;
7 x 3 = 21.*/

	cout << "Задача №5" << endl;
	int k, table = 0;
		cout << "Табличка множення на "; cin >> k;
		for (int i = 1; i <= 10; i++)
		{
			table = 0;
			table = k * i;
			cout << k << " * " << i << " = " << table << endl;
		}
}